# Investor - Flow of Funds - US

### Introduction:

Special thanks to: https://github.com/rgrp for sharing the dataset.

### Step 1. Import the necessary libraries

In [17]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/datasets/investor-flow-of-funds-us/master/data/weekly.csv).

### Step 3. Assign it to a variable called

In [18]:
address = pd.read_csv("https://raw.githubusercontent.com/datasets/investor-flow-of-funds-us/master/data/weekly.csv")
address.head()

,Date,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
0,2012-12-05,-7426,-6060,-1367,-74,5317,4210,1107,-2183
1,2012-12-12,-8783,-7520,-1263,123,1818,1598,219,-6842
2,2012-12-19,-5496,-5470,-26,-73,103,3472,-3369,-5466
3,2012-12-26,-4451,-4076,-375,550,2610,3333,-722,-1291
4,2013-01-02,-11156,-9622,-1533,-158,2383,2103,280,-8931

### Step 4.  What is the frequency of the dataset?

In [19]:
address['Total Equity'].value_counts()

-7426     1
-8783     1
 2671     1
-577      1
-4024     1
 1257     1
-32       1
 1464     1
-3010     1
-1175     1
-3913     1
 1774     1
 1267     1
 4343     1
 4240     1
 1268     1
 999      1
 3911     1
 1948     1
-1167     1
-1527     1
 320      1
-471      1
 118      1
-3890     1
-5496     1
-4451     1
-11156    1
 14817    1
 3155     1
 5761     1
 2286     1
 3530     1
 632      1
 666      1
-1079     1
 697      1
-2453     1
 2098     1
 1236     1
-922      1
-93       1
-7835     1
 1906     1
Name: Total Equity, dtype: int64

### Step 5. Set the column Date as the index.

In [20]:
address.set_index("Date", inplace=True)

### Step 6. What is the type of the index?

In [21]:
address.index.dtype

dtype('O')

### Step 7. Set the index to a DatetimeIndex type

In [22]:
address.index = address.index.astype('datetime64[ns]')

### Step 8.  Change the frequency to monthly, sum the values and assign it to monthly.

In [23]:
address = address.reset_index()
address.groupby(address["Date"].dt.month).sum()

C:\Users\egypi\AppData\Local\Temp\ipykernel_19160\1226362591.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  address.groupby(address["Date"].dt.month).sum()

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
1,7132,-2791,9923,4459,19517,12176,7341,31109
2,5508,3509,1999,1752,9099,7443,1656,16359
3,5691,-8176,13867,2829,9138,7267,1870,17657
4,11221,-3580,14801,5901,8916,7707,1209,26039
5,-2203,-8720,6518,3172,13767,10192,3576,14736
6,2319,-6546,8865,4588,9715,7551,2163,16621
7,-7051,-11128,4078,2666,7506,7026,481,3122
8,1943,-5508,7452,1885,1897,-1013,2910,5723
9,-2767,-6596,3829,1599,3984,2479,1504,2816
11,-2753,-7239,4485,729,14528,11566,2962,12502
12,-26156,-23126,-3031,526,9848,12613,-2765,-15782

### Step 9. You will notice that it filled the dataFrame with months that don't have any data with NaN. Let's drop these rows.

In [28]:
address.dropna().head(10)

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
2012-12-05,-7426,-6060,-1367,-74,5317,4210,1107,-2183
2012-12-12,-8783,-7520,-1263,123,1818,1598,219,-6842
2012-12-19,-5496,-5470,-26,-73,103,3472,-3369,-5466
2012-12-26,-4451,-4076,-375,550,2610,3333,-722,-1291
2013-01-02,-11156,-9622,-1533,-158,2383,2103,280,-8931
2013-01-09,14817,7995,6821,2888,9766,7311,2455,27471
2014-04-02,3155,938,2217,265,3379,3129,250,6799
2014-04-09,5761,2080,3681,1482,1609,1448,161,8852
2014-04-16,2286,634,1652,1186,633,604,29,4105
2014-04-23,3530,1392,2138,1239,1984,1453,531,6753

### Step 10. Good, now we have the monthly data. Now change the frequency to year.

In [26]:
address.set_index("Date", inplace=True)
address.resample('Y').mean()

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
2012-12-31,-6539.000000,-5781.500000,-757.750000,131.500000,2462.000000,3153.250000,-691.250000,-3945.500000
2013-12-31,1830.500000,-813.500000,2644.000000,1365.000000,6074.500000,4707.000000,1367.500000,9270.000000
2014-12-31,12.692308,-1718.807692,1731.576923,752.692308,2303.461538,1730.538462,572.923077,3068.730769
2015-12-31,1254.083333,-871.583333,2125.666667,606.666667,2169.000000,1498.833333,670.083333,4029.750000